arduino/Arduino/hardware/c2000/cores/c2000/f2802x_common/include/F2802x_SWPrioritizedIsrLevels.h
// TI File $Revision: /main/3 $
// Checkin $Date: November 10, 2008   10:44:09 $
//###########################################################################
//
// FILE:    DSP2802x_SWPrioritizedIsrLevels.h
//
// TITLE:   DSP28 Devices Software Prioritized Interrupt Service Routine
//          Level definitions.
//
//###########################################################################
// $TI Release: f2802x Support Library v210 $
// $Release Date: Mon Sep 17 09:13:31 CDT 2012 $
//###########################################################################

#ifndef DSP2802x_SW_PRIORITZIED_ISR_H
#define DSP2802x_SW_PRIORITZIED_ISR_H

#ifdef __cplusplus
extern "C" {
#endif

//-------------------------------------------------------------------------------
// Interrupt Enable Register Allocation For 2802x Devices:
//-------------------------------------------------------------------------------
// Interrupts can be enabled/disabled using the CPU interrupt enable register
// (IER) and the PIE interrupt enable registers (PIEIER1 to PIEIER12).
//-------------------------------------------------------------------------------
//-------------------------------------------------------------------------------
// Set "Global" Interrupt Priority Level (IER register):
//-------------------------------------------------------------------------------
// The user must set the appropriate priority level for each of the CPU
// interrupts. This is termed as the "global" priority. The priority level
// must be a number between 1 (highest) to 16 (lowest). A value of 0 must
// be entered for reserved interrupts or interrupts that are not used. This
// will also reduce code size by not including ISR's that are not used.
//
// Note: The priority levels below are used to calculate the IER register
//       interrupt masks MINT1 to MINT16.
//
//
// Note: The priority levels shown here may not make sense in a
//       real application.  This is for demonstration purposes only!!!
//
//       The user should change these to values that make sense for
//       their application.
//
// 0  = not used
// 1  = highest priority
// ...
// 16 = lowest priority
#define    INT1PL      2        // Group1 Interrupts (PIEIER1)
#define    INT2PL      1        // Group2 Interrupts (PIEIER2)
#define    INT3PL      4        // Group3 Interrupts (PIEIER3)
#define    INT4PL      2        // Group4 Interrupts (PIEIER4)
#define    INT5PL      2        // Group5 Interrupts (PIEIER5)
#define    INT6PL      3        // Group6 Interrupts (PIEIER6)
#define    INT7PL      0        // reserved
#define    INT8PL      0        // reserved
#define    INT9PL      3        // Group9 Interrupts (PIEIER9)
#define    INT10PL     0        // reserved
#define    INT11PL     0        // reserved
#define    INT12PL     0        // reserved
#define    INT13PL     4        // TINT1
#define    INT14PL     4        // INT14 (TINT2)
#define    INT15PL     4        // DATALOG
#define    INT16PL     4        // RTOSINT

//-------------------------------------------------------------------------------
// Set "Group" Interrupt Priority Level (PIEIER1 to PIEIER12 registers):
//-------------------------------------------------------------------------------
// The user must set the appropriate priority level for each of the PIE
// interrupts. This is termed as the "group" priority. The priority level
// must be a number between 1 (highest) to 8 (lowest). A value of 0 must
// be entered for reserved interrupts or interrupts that are not used. This
// will also reduce code size by not including ISR's that are not used:
//
// Note: The priority levels below are used to calculate the following
//       PIEIER register interrupt masks:
//                           MG11 to MG18
//                           MG21 to MG28
//                           MG31 to MG38
//                           MG41 to MG48
//                           MG51 to MG58
//                           MG61 to MG68
//                           MG71 to MG78
//                           MG81 to MG88
//                           MG91 to MG98
//                           MG101 to MG108
//                           MG111 to MG118
//                           MG121 to MG128
//
// Note: The priority levels shown here may not make sense in a
//       real application.  This is for demonstration purposes only!!!
//
//       The user should change these to values that make sense for
//       their application.
//
// 0  = not used
// 1  = highest priority
// ...
// 8  = lowest priority
//

#define    G11PL       7        // ADCINT1     (ADC)  or reserved if 10.1 is ADCINT1
#define    G12PL       6        // ADCINT2     (ADC)  or reserved if 10.2 is ADCINT2
#define    G13PL       0        // reserved
#define    G14PL       1        // XINT1       (External)
#define    G15PL       3        // XINT2       (External)
#define    G16PL       2        // ADCINT9     (ADC)
#define    G17PL       1        // TINT0       (CPU Timer 0)
#define    G18PL       5        // WAKEINT     (WD/LPM)

#define    G21PL       4        // EPWM1_TZINT (EPwm1 Trip)
#define    G22PL       3        // EPWM2_TZINT (EPwm2 Trip)
#define    G23PL       2        // EPWM3_TZINT (EPwm3 Trip)
#define    G24PL       1        // EPWM4_TZINT (EPwm4 Trip)
#define    G25PL       0        // reserved
#define    G26PL       0        // reserved
#define    G27PL       0        // reserved
#define    G28PL       0        // reserved

#define    G31PL       4        // EPWM1_INT   (EPwm1 Int)
#define    G32PL       1        // EPWM2_INT   (EPwm2 Int)
#define    G33PL       1        // EPWM3_INT   (EPwm3 Int)
#define    G34PL       2        // EPWM4_INT   (EPwm4 Int)
#define    G35PL       0        // reserved
#define    G36PL       0        // reserved
#define    G37PL       0        // reserved
#define    G38PL       0        // reserved

#define    G41PL       1        // ECAP1_INT   (eCAP1 Int)
#define    G42PL       0        // reserved
#define    G43PL       0        // reserved
#define    G44PL       0        // reserved
#define    G45PL       0        // reserved
#define    G46PL       0        // reserved
#define    G47PL       0        // reserved
#define    G48PL       0        // reserved

#define    G51PL       0        // reserved
#define    G52PL       0        // reserved
#define    G53PL       0        // reserved
#define    G54PL       0        // reserved
#define    G55PL       0        // reserved
#define    G56PL       0        // reserved
#define    G57PL       0        // reserved
#define    G58PL       0        // reserved

#define    G61PL       2        // SPIRXINTA (SPI-A)
#define    G62PL       1        // SPITXINTA (SPI-A)
#define    G63PL       0        // reserved
#define    G64PL       0        // reserved
#define    G65PL       0        // reserved
#define    G66PL       0        // reserved
#define    G67PL       0        // reserved
#define    G68PL       0        // reserved


#define    G71PL      0        // reserved
#define    G72PL      0        // reserved
#define    G73PL      0        // reserved
#define    G74PL      0        // reserved
#define    G75PL      0        // reserved
#define    G76PL      0        // reserved
#define    G77PL      0        // reserved
#define    G78PL      0        // reserved


#define    G81PL       1        // I2CINT1A  (I2C-A)
#define    G82PL       2        // I2CINT2A  (I2C-A)
#define    G83PL       0        // reserved
#define    G84PL       0        // reserved
#define    G85PL       0        // reserved
#define    G86PL       0        // reserved
#define    G87PL       0        // reserved
#define    G88PL       0        // reserved

